#include<graphics.h>
#include<conio.h> // for _getch()
int main()
{
	//创建easyX窗口：宽度和高度
	initgraph(1200, 700);

	////圆：圆心坐标和半径
	//circle(100, 100, 30);

	////矩形：左上和右下坐标
	//rectangle(200, 100, 300, 200);

	////线：起点和终点：
	//line(100, 200, 200, 100);

	////多边形：传入一组点和边数
	//POINT arr[3] = {
	//	{300,300},
	//	{400,200},
	//	{300,200}
	//};
	//polygon(arr, 3);


	//绘制房子：

	//主体：
	rectangle(100, 200, 375, 430);

	//烟囱：
	rectangle(330, 30, 380, 160);

	//门
	rectangle(165, 325, 220, 430);

	//窗户：
	rectangle(275, 235, 335, 295);

	//屋顶
	POINT arr[3] = { {240,20},{45,200},{435,200} };
	polygon(arr, 3);

	//门把手：
	circle(207, 385, 9);

	//线：
	line(0, 430, 500, 430);
	line(305, 235, 305, 295);
	line(275, 265, 335, 265);

	//卡住窗口：
	//_getch()接受一个字符输入，而且不用按回车，只要按一个字符即可
	_getch();

	//关闭窗口：
	closegraph();

	return 0;
}